In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame({"A":["Sandy", "alex", "brook", "kelly", np.nan], 
                   "B":[np.nan, "olivia", "olivia", "", "amanda"],  
                   "C":[20 + 5j, 20 + 5j, 7, None, 8], 
                   "D":[14.8, 3, None, 6, 6]})

In [3]:
data = df.copy()

In [4]:
data

       A       B        C     D
0  Sandy     NaN  (20+5j)  14.8
1   alex  olivia  (20+5j)   3.0
2  brook  olivia   (7+0j)   NaN
3  kelly              NaN   6.0
4    NaN  amanda   (8+0j)   6.0

In [8]:
data.nunique(axis = 0,dropna = True)

A    4
B    3
C    3
D    3
dtype: int64

In [9]:
duct1 = {
    'name':['khan','rahul','taukir','mohd','khan'],
    'location' : ['meerut','delhi','kanpur','agra','meerut'],
    'salary' : [50000,25000,3000,150000,25000]
}
dataset = pd.DataFrame(duct1)

In [10]:
dataset

     name location  salary
0    khan   meerut   50000
1   rahul    delhi   25000
2  taukir   kanpur    3000
3    mohd     agra  150000
4    khan   meerut   25000

In [44]:
cc = dataset.groupby('name')['salary'].agg('sum')
cc

name
khan       75000
mohd      150000
rahul      25000
taukir      3000
Name: salary, dtype: int64

In [46]:
locationStat = dataset.groupby('location')['location'].agg('count').sort_values(ascending = False)

In [47]:
data1 = {
    'age':[20,21,10,20,10,25,20,10,35],
    'name' : list('abcdefghi')
}

In [49]:
ds = pd.DataFrame(data1)
ds

   age name
0   20    a
1   21    b
2   10    c
3   20    d
4   10    e
5   25    f
6   20    g
7   10    h
8   35    i

In [52]:
ds.describe()

             age
count   9.000000
mean   19.000000
std     8.231039
min    10.000000
25%    10.000000
50%    20.000000
75%    21.000000
max    35.000000

In [57]:
ds.groupby('age')['age'].agg('count').sort_values()

age
21    1
25    1
35    1
10    3
20    3
Name: age, dtype: int64

In [54]:
ds['age'].max()

35